MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M2351CIAAE/mcu.h
#if defined (SCU_INIT_IONSSET_VAL) && (SCU_INIT_IONSSET_VAL & BIT3 )
# define PD PD_NS
#else
# define PD PD_S
#endif

#if defined (SCU_INIT_IONSSET_VAL) && (SCU_INIT_IONSSET_VAL & BIT4 )
# define PE PE_NS
#else
# define PE PE_S
#endif

#if defined (SCU_INIT_IONSSET_VAL) && (SCU_INIT_IONSSET_VAL & BIT5 )
# define PF PF_NS
#else
# define PF PF_S
#endif

#if defined (SCU_INIT_IONSSET_VAL) && (SCU_INIT_IONSSET_VAL & BIT6 )
# define PG PG_NS
#else
# define PG PG_S
#endif

#if defined (SCU_INIT_IONSSET_VAL) && (SCU_INIT_IONSSET_VAL & BIT7 )
# define PH PH_NS
#else
# define PH PH_S
#endif



/**@}*/ /* end of group PMODULE */

/* --------------------  End of section using anonymous unions  ------------------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

#ifdef __cplusplus
}
#endif


/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
// Note: Changed for MikroE implementation.
// #include "sys.h"
// Note: Changed for MikroE implementation.
// #include "clk.h"
// Note: Changed for MikroE implementation.
// #include "dac.h"
// Note: Changed for MikroE implementation.
// #include "eadc.h"
// Note: Changed for MikroE implementation.
// #include "ebi.h"
// Note: Changed for MikroE implementation.
// #include "ecap.h"
// Note: Changed for MikroE implementation.
// #include "fmc.h"
// Note: Changed for MikroE implementation.
// #include "gpio.h"
// Note: Changed for MikroE implementation.
// #include "i2c.h"
// Note: Changed for MikroE implementation.
// #include "i2s.h"
// Note: Changed for MikroE implementation.
// #include "bpwm.h"
// Note: Changed for MikroE implementation.
// #include "epwm.h"
// Note: Changed for MikroE implementation.
// #include "qspi.h"
// Note: Changed for MikroE implementation.
// #include "spi.h"
// Note: Changed for MikroE implementation.
// #include "timer.h"
// Note: Changed for MikroE implementation.
// #include "timer_pwm.h"
// Note: Changed for MikroE implementation.
// #include "wdt.h"
// Note: Changed for MikroE implementation.
// #include "wwdt.h"
// Note: Changed for MikroE implementation.
// #include "rtc.h"
// Note: Changed for MikroE implementation.
// #include "uart.h"
// Note: Changed for MikroE implementation.
// #include "acmp.h"
// Note: Changed for MikroE implementation.
// #include "crc.h"
// Note: Changed for MikroE implementation.
// #include "usbd.h"
// Note: Changed for MikroE implementation.
// #include "otg.h"
// Note: Changed for MikroE implementation.
// #include "pdma.h"
// Note: Changed for MikroE implementation.
// #include "ebi.h"
// Note: Changed for MikroE implementation.
// #include "crypto.h"
// Note: Changed for MikroE implementation.
// #include "sc.h"
// Note: Changed for MikroE implementation.
// #include "scuart.h"
// Note: Changed for MikroE implementation.
// #include "usci_spi.h"
// Note: Changed for MikroE implementation.
// #include "usci_uart.h"
// Note: Changed for MikroE implementation.
// #include "usci_i2c.h"
// Note: Changed for MikroE implementation.
// #include "sdh.h"
// Note: Changed for MikroE implementation.
// #include "qei.h"
// Note: Changed for MikroE implementation.
// #include "can.h"
// Note: Changed for MikroE implementation.
// #include "scu.h"
// Note: Changed for MikroE implementation.
// #include "mkromlib.h"

#endif  /* __M2351_H__ */



